Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              + "cert-manager.io/common-name"      = "pritunl.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-pritunl-tls"
          ~ resource_version = "30625472" -> "30625960"
            # (4 unchanged attributes hidden)
        }
    }
  # helm_release.loki has been changed
~ resource "helm_release" "loki" {
        id                         = "loki"
      ~ metadata                   = [
          ~ {
              ~ values      = jsonencode(
                  ~ {} -> null
                )
                # (6 unchanged elements hidden)
            },
        ]
        name                       = "loki"
        # (26 unchanged attributes hidden)
    }
  # kubernetes_secret.tls-vpn has been changed
~ resource "kubernetes_secret" "tls-vpn" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-vpn-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "vpn.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-vpn-tls"
              + "cert-manager.io/common-name"      = "vpn.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-vpn-tls"
          ~ resource_version = "30625471" -> "30625943"
            # (4 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # kubernetes_ingress.loki_cluster_ingress["wayofthesys.com"] will be created
+ resource "kubernetes_ingress" "loki_cluster_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer"          = "zerossl"
              + "ingress.kubernetes.io/rewrite-target"    = "/"
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/auth-signin" = "https://$host/oauth2/start?rd=https://$host$request_uri$is_args$args"
              + "nginx.ingress.kubernetes.io/auth-url"    = "https://$host/oauth2/auth"
            }
          + generation       = (known after apply)
          + name             = "wayofthesys.com-loki-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "loki.wayofthesys.com"

              + http {
                  + path {
                      + path = "/"

                      + backend {
                          + service_name = "loki"
                          + service_port = "3100"
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "loki.wayofthesys.com",
                ]
              + secret_name = "wayofthesys-com-loki-tls"
            }
        }
    }

  # kubernetes_secret.loki-tls will be created
+ resource "kubernetes_secret" "loki-tls" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "wayofthesys-com-loki-tls"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.tls will be updated in-place
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls" -> null
              - "cert-manager.io/common-name"      = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-pritunl-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.tls-vpn will be updated in-place
~ resource "kubernetes_secret" "tls-vpn" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-vpn-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "vpn.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-vpn-tls" -> null
              - "cert-manager.io/common-name"      = "vpn.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-vpn-tls"
            # (5 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Argument is deprecated

  with tls_self_signed_cert.ca-vpn,
  on tls-vpn.tf line 20, in resource "tls_self_signed_cert" "ca-vpn":
  20:   key_algorithm   = tls_private_key.ca-vpn.algorithm

This is now ignored, as the key algorithm is inferred from the
`private_key_pem`.

(and 11 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
